### Working with pandas dataframes

[Official Documentation](https://pandas.pydata.org/docs/)

[Course page](https://ds.codeup.com/python/dataframes/)

<div class="alert alert-block alert-info">

#### Learning Goals
    
- Understand the structure of a dataframe
- View information about the contents of a dataframe
- Determine attributes of the data within the dataframe
- Manipulate columns
- Sort and filter contents of dataframe
- Create, modify, and drop columns
- View descriptive statistics for data

In [1]:
import pandas as pd

### Sources of dataframes

- Created from dictionaries, lists, or arrays
- Imported from Python libraries (e.g. `pydataset`)
- Read from `csv`, `tsv`, `xlsx` files
- SQL databases

---

### Import statements

In [5]:
# Imported libraries
import pandas as pd

# Numpy to build arrays
import numpy as np

# Source of datasets
from pydataset import data

# Set a value to initialize the random integer generation
np.random.seed(123)

---

## Creating a dataframe

- Combine multiple series of equal length.

In [6]:
# Create a list of students
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas', 'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [7]:

# Randomly generate 12 scores for each subject (1 per student)
# Store values as arrays
# Note that all the values need to have the same length here

math_grades = np.random.randint(low=60, high=100, size=len(students))

english_grades = np.random.randint(low=60, high=100, size=len(students))

reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [8]:
# Create a dictionary with structure:
# 'column_name': <array or list>

df_dict = {'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades}

In [238]:

# Use pd.DataFrame
df = pd.DataFrame(df_dict)

# View the type
type(df)

pandas.core.frame.DataFrame

### Check data types

In [10]:
type(students)

list

In [11]:
type(reading_grades)

numpy.ndarray

In [12]:
type(df_dict)

dict

### Display a table for the dataframe

In [13]:
display(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Dimension of dataframe

Format: A tuple with (rows, columns)

In [14]:
df.shape

(12, 4)

### View portions of the dataframe

```python
.head(n) # first n rows (default = 5 rows)
.tail(n) # last n rows (default = 5 rows)
.sample(n) # randomly select n rows (default = 1 row)
```

In [15]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

In [16]:
df.tail()

       name  math  english  reading
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [141]:
df.sample(3)

     name  math  english  reading
6  Thomas    82       64       81
8  Albert    92       62       87
5    John    79       76       93

### Information about the dataframe's contents

| Name | Description |
| ---:|:------ |
|`#`  | The row index|
|`Column`| Index/name of column (a string) |
|`Non-Null Count` | Number of non-empty values 
|`Dtype` |    The data type |

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

### Data types

In [147]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

### Descriptive Statistics

In [149]:
df.describe().round()

       math  english  reading
count  12.0     12.0     12.0
mean   85.0     78.0     86.0
std    11.0     13.0     10.0
min    62.0     62.0     67.0
25%    78.0     64.0     81.0
50%    90.0     78.0     89.0
75%    92.0     87.0     93.0
max    98.0     99.0     98.0

---

## Working with Columns

- View column information
- Rename columns
- Drop columns

### View Column Information

In [150]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

### Check data types

In [151]:
type(df.columns)

pandas.core.indexes.base.Index

<div class="alert alert-block alert-info">
    
### Important Notes
    
- Keep in mind what data structure you are working with
- Recall that methods do not alter the original data structure
- Check documentation for what the parameters and results of a pandas function are

In [153]:
col_list = df.columns.tolist()
type(col_list)

list

In [154]:
col_list

['name', 'math', 'english', 'reading']

### Dropping columns

In [155]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [156]:
df.drop(columns=['english', 'reading'])

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92


### Tip

- Create a list with the columns you want to drop

In [157]:
dropped_columns = ['english', 'reading']

In [158]:
df.drop(columns = ['english', 'reading'])

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

### Renaming columns

- Rename the columne `name` to `student`
- Use a dictionary structure
- Assign to a new dataframe

```python
{'old_name': 'new_name'}
```

In [159]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [160]:
df.rename(columns = {'name':'student'})

    student  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Selecting a column

In [166]:
math_reading_performance = df[['math','reading']]
# double [[]] makes it a dataframe

In [167]:
type(math_reading_performance)

pandas.core.frame.DataFrame

In [168]:
math_series = df['math']

In [169]:
type(math_series)

pandas.core.series.Series

In [170]:
math_reading_performance

    math  reading
0     62       80
1     88       67
2     94       95
3     98       88
4     77       98
5     79       93
6     82       81
7     93       90
8     92       87
9     69       94
10    92       93
11    92       72

### Creating new columns


- Use a comparison operator on a column to return Boolean values 
- Create a new column with these contents
- Use assign to set the column values equal to the Boolean values

In [171]:
# column bracket notation
df['passing_math'] = df.math >= 70

In [172]:
df

       name  math  english  reading  passing_math
0     Sally    62       85       80         False
1      Jane    88       79       67          True
2     Suzie    94       74       95          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
5      John    79       76       93          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
9   Richard    69       80       94         False
10    Isaac    92       99       93          True
11     Alan    92       62       72          True

In [ ]:
df.assign(passing_english=df.english>= 70)

In [175]:
df_passing_math = df[df.math >= 70]
df_passing_math

      name  math  english  reading  passing_math
1     Jane    88       79       67          True
2    Suzie    94       74       95          True
3    Billy    98       96       88          True
4      Ada    77       92       98          True
5     John    79       76       93          True
6   Thomas    82       64       81          True
7    Marie    93       63       90          True
8   Albert    92       62       87          True
10   Isaac    92       99       93          True
11    Alan    92       62       72          True

In [177]:
df_high_score_math = df[df.math >= 90]
df_high_score_math

      name  math  english  reading  passing_math
2    Suzie    94       74       95          True
3    Billy    98       96       88          True
7    Marie    93       63       90          True
8   Albert    92       62       87          True
10   Isaac    92       99       93          True
11    Alan    92       62       72          True

---

### Sorting dataframes

- Use `.sort_values`
- set which column to sort by
- Set ascending or descending

In [179]:
df.sort_values(by='english', ascending = False)

       name  math  english  reading  passing_math
10    Isaac    92       99       93          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
0     Sally    62       85       80         False
9   Richard    69       80       94         False
1      Jane    88       79       67          True
5      John    79       76       93          True
2     Suzie    94       74       95          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
11     Alan    92       62       72          True

### Chaining Operations

In [193]:
df[df.english > 90].sort_values(by='english').head(1).name

4    Ada
Name: name, dtype: object

---

## Importing datasets

```python
import pandas as pd
from pydataset import data
```

### View available datasets

In [194]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [195]:
 data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

---
<div class="alert alert-block alert-success">
    
### In-class exercise 

- Randomly select one dataset from `pydataset`
- Load the dataset as a dataframe
- View information about the dataset

In [196]:
data('sleepstudy', show_doc = True)

sleepstudy

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Reaction times in a sleep deprivation study

### Description

The average reaction time per day for subjects in a sleep deprivation study.
On day 0 the subjects had their normal amount of sleep. Starting that night
they were restricted to 3 hours of sleep per night. The observations represent
the average reaction time on a series of tests given each day to each subject.

### Format

A data frame with 180 observations on the following 3 variables.

`Reaction`

Average reaction time (ms)

`Days`

Number of days of sleep deprivation

`Subject`

Subject number on which the observation was made.

### Details

These data are from the study described in Belenky et al. (2003), for the
sleep-deprived group and for the first 10 days of the study, up to the
recovery period.

### References

Gregory Belenky, Nancy J. Wesensten, David R. Thorne, Maria L. Thomas, Helen
C. Sing, Daniel P. Redmond, Michael B. Russo and Thomas J. Balkin (2003)
Patterns of performance degradation and restoration during sleep restriction
and subsequent recovery: a sleep dose-response study. _Journal of Sleep
Research_ **12**, 1–12.

### Examples

    str(sleepstudy)
    require(lattice)
    xyplot(Reaction ~ Days | Subject, sleepstudy, type = c("g","p","r"),
           index = function(x,y) coef(lm(y ~ x))[1],
           xlab = "Days of sleep deprivation",
           ylab = "Average reaction time (ms)", aspect = "xy")
    (fm1 <- lmer(Reaction ~ Days + (Days|Subject), sleepstudy))
    (fm2 <- lmer(Reaction ~ Days + (1|Subject) + (0+Days|Subject), sleepstudy))

In [236]:
ss = data('sleepstudy')
ss

     Reaction  Days  Subject
1    249.5600     0      308
2    258.7047     1      308
3    250.8006     2      308
4    321.4398     3      308
5    356.8519     4      308
..        ...   ...      ...
176  329.6076     5      372
177  334.4818     6      372
178  343.2199     7      372
179  369.1417     8      372
180  364.1236     9      372

[180 rows x 3 columns]


---

### Logical Operators


 `&`    and 
 
 `|`    or
 
 `not`  not

### Find students who are eligible for:

- High-performer award (At leat 80 in Math and English)
- Subject award (at least 90 in a subject)
- Exemplary award (at least 90 in all subjects)

In [245]:
df_high_performer = df[ (df['math'] >= 80) & (df['english'] >= 80)]
df_high_performer

     name  math  english  reading
3   Billy    98       96       88
10  Isaac    92       99       93

In [249]:
df_exemplary_award = df[ (df['math'] >= 90) & (df['english'] >= 90) & (df['reading'] >= 90)]
df_exemplary_award

     name  math  english  reading
10  Isaac    92       99       93

In [251]:
df_subject_award = df[ (df['math'] >= 90) | (df['english'] >= 90) | (df['reading'] >= 90)]
df_subject_award

       name  math  english  reading
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72